# DirectContext3DHandleOverrides Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectContext3DHandleOverrides Class
Members See Also
---
A set of DirectContext3DHandleSettings that are stored by a view.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class DirectContext3DHandleOverrides : IDisposable
```

Visual Basic
---
```text
Public Class DirectContext3DHandleOverrides _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DirectContext3DHandleOverrides : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..DirectContext3DHandleOverrides
# See Also
DirectContext3DHandleOverrides Members
Autodesk.Revit.DB.DirectContext3D Namespace